lowReRNGKE/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type            meanVelocityForce;

    selectionMode   all;

    fields          (U);
    Ubar            (1.4 0 0);
}


//does not work
/*directionalPressureGradientExplicitSource1
{
        // Mandatory entries (unmodifiable)
        type            directionalPressureGradientExplicitSource;

        // Mandatory entries (unmodifiable)
        model       constant;
        fields      (p);

        // Mandatory entries (runtime modifiable)
        flowDir     (1 0 0);
        faceZone    inlet;

        // Conditional mandatory entries (unmodifiable)

            // when model=constant
            pressureDrop    40;

        // Optional entries (runtime modifiable)
        relaxationFactor    0.3;

        // Mandatory/Optional (inherited) entries
        selectionMode   all;       
}
*/

// ************************************************************************* //
