lowReRNGKE/system/blockMeshDict.fullHeight
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;
geom
{
    L 5;
    H 2;
    Nx 50;
    Ny 60;
    y_grading 4;
};

vertices
(
    (0 0 0)
    ($:geom.L 0 0)
    ($:geom.L $:geom.H 0)
    (0 $:geom.H 0)    

    (0 0 0.1)
    ($:geom.L 0 0.1)
    ($:geom.L $:geom.H 0.1)
    (0 $:geom.H 0.1)
);


blocks
(
    hex (0 1 2 3 4 5 6 7)
    ($:geom.Nx $:geom.Ny 1)
    simpleGrading 
    (
        1 
        (
            (0.2 0.3 $:geom.y_grading)    // 20% y-dir, 30% cells, expansion = 4
            (0.6 0.4 1)    // 60% y-dir, 40% cells, expansion = 1
            (0.2 0.3 #eval{1/$:geom.y_grading}) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)
        )
        1
    )

 
);

edges
(
);

boundary
(
    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        transform translational;
        separationVector ($:geom.L 0 0);
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        transform translational;
        separationVector (#eval{-$:geom.L} 0 0);
        faces
        (
            (1 5 6 2)
            
        );
    }
    
    upperWall
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }
    
    lowerWall
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
    
    front
    {
        type empty;
        faces
        (
            (0 1 2 3)
        );
    }
    
    back
    {
        type empty;
        faces
        (
            (4 7 6 5)
        );
    }

);


// ************************************************************************* //
